module MultiplicationPair where

-- ---------------------------------------------------------------------------
-- このコードでは、2つの自然数の組"Pair"を定義すれば、
-- 組を与えれば自然数のかけ算を実現するのに十分であることを証明する。
-- 言い換えれば、自然数の掛け算にとって、順序は不要な情報である事を示すため、
-- 順序を取り除いた「組」のみで、自然数のかけ算を実現できる事を示す。
-- well-definedness(定値性)に基づいた証明アプローチ。
-- 
-- 以上の内容をAgdaで確認するためのコードである。
-- ---------------------------------------------------------------------------

-- ---------------------------------------------------------------------------
-- 0. 証明に使うライブラリ読み込みと定義
--    自然数のかけ算 "*", 自然数のかけ算の交換則 "*-comm",
--    直積 "x", 順序対を作る ",",
--    直和"_⊎_"　A ⊎ Bで、型Aか型Bの「どちらか一つ」を持てる型を作る
--    "inj₁" 左側(A)の成立を示すコンストラクタ, "inj₂" 右側(B)の成立を示すコンストラクタ
-- ---------------------------------------------------------------------------

open import Data.Nat using (ℕ; _*_)
open import Data.Nat.Properties using (*-comm)
open import Data.Product using (_×_; _,_)
open import Data.Sum using (_⊎_; inj₁; inj₂)

open import Relation.Binary.PropositionalEquality
open ≡-Reasoning

-- 1. 順序対の型 ここでは、まず自然数を順序を持ったPair、つまり順序対を作っている
Pair : Set
Pair = ℕ × ℕ

-- 2. 順序対から「組（非順序対）」を表現するために同値関係を定義する
--  (a, b) と (c, d) が組として等しくなるには、
-- 「a=c かつ b=d」 または 「a=d かつ b=c」であること
-- 上記の条件は、（2数が順序まで等しいケース）または（2数の順序を入れ替えると同じになるケース）である事、と言っている
_~_ : Pair → Pair → Set
(a , b) ~ (c , d) = ((a ≡ c) × (b ≡ d)) ⊎ ((a ≡ d) × (b ≡ c))

-- 3. 自然数のペアから積を受け取る定義
-- ここで、自然数のかけ算 "*" はライブラリから呼んでいる。どんな実装でも不問
mul : Pair → ℕ
mul (a , b) = a * b

-- 4. 「組（非順序対）を与えるだけで十分である」ことの証明
-- 同値なペアを渡せば、必ず同じ積の結果が得られる（well-definedである）ことを示す
-- つまり、"順序"と言う情報が不要である事、を示すに等しい

-- 任意のペアp1, p2があって、p1 と p2 が同値なら mul p1とmul p2は等しい
mul-well-defined : ∀ p1 p2 → p1 ~ p2 → mul p1 ≡ mul p2

-- ケース1: (a, b) と (c, d) がそのまま等しい場合 (a=c, b=d)
-- 任意の(a, b)と(.a, .b)があって(∀ p1 p2 に代入)
-- p1 ~ p2 が同値である (inj₁ (refl , refl)) p1 と p2がそのまま同じ
-- (inj₁ (refl , refl))は、(inj₁ ((a ≡ c) , (b ≡ d)))だ、ということを表現
-- 組p1, p2を与えたときのかけ算は等しい。
mul-well-defined (a , b) (.a , .b) (inj₁ (refl , refl)) = refl

-- ケース2: (a, b) と (c, d) が逆順で等しい場合 (a=d, b=c)
-- ケース1の逆。交換則(*-comm)を適用すると等しい。
-- ここで、自然数の掛け算の交換則 (*-comm) が必要になります。
mul-well-defined (a , b) (.b , .a) (inj₂ (refl , refl)) = *-comm a b

-- ===================================================================
-- 結論：自然数のかけ算に順序は不要であり、自然数の組を与えれば十分と証明完了
-- ===================================================================
-- 自然数のかけ算には、2数を与える順序は不要であり、
-- 順序という概念を取り除いた、自然数の「組」で成立することを示した。
-- 
-- 自然数のかけ算には交換則がある時点で、必然的に順序が不要になる事を直感的に理解できる。
-- 客観的に証明すると、本コードの通り。
-- 
-- また、今回はライブラリにあるかけ算を使って証明をした。
-- これは、内部で自然数のかけ算がどのようなプロセスで実装されていようとも、
-- 自然数の構成、掛け算の構成が正しくなされている限り、本証明には影響しないため、
-- 実装はブラックボックスのまま、ライブラリに任せた。
--
-- たまたまではあるが、自然数のかけ算の実装によらずに証明できる、ことを体現した。
